{
  "model_type": "gemma3",
  "architectures": ["Gemma3ForCausalLM"],
  "hidden_size": 2048,
  "intermediate_size": 8192,
  "num_hidden_layers": 18,
  "num_attention_heads": 8,
  "num_key_value_heads": 4,
  "head_dim": 256,
  "max_position_embeddings": 8192,
  "vocab_size": 256000,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "hidden_activation": "gelu_pytorch_tanh",
  "initializer_range": 0.02,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.0",
  "use_cache": true,
  "quantization": {
    "group_size": 64,
    "bits": 4
  }
}
